# YOLOv12-Vine

# Parameters
nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,        [64, 3, 2]]            # 0-P1/2
  - [-1, 1, Conv,        [128, 3, 2, 1, 2]]     # 1-P2/4
  - [-1, 2, C3_Res2Block,[256, True]]           # 2  (was C3k2)
  - [-1, 1, Conv,        [256, 3, 2, 1, 4]]     # 3-P3/8
  - [-1, 2, C3_Res2Block,[512, True]]           # 4  (was C3k2)
  - [-1, 1, Conv,        [512, 3, 2]]           # 5-P4/16
  - [-1, 4, A2C2f,       [512, True, 4]]        # 6  
  - [-1, 1, Conv,        [1024, 3, 2]]          # 7-P5/32
  - [-1, 1, SPPRFEM,     [1024, 5]]             # 8  (SPP+RFEM, replaces A2C2f)
  - [-1, 1, C3RFEM,      [1024, False]]         # 9  (final backbone stage)

head:
  # P5 -> P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 10
  - [[-1, 6], 1, Concat, [1]]                   # 11, cat with backbone P4 (index 6)
  - [-1, 2, C3RFEM,      [512, False]]          # 12, RFEM neck for P4 (was A2C2f)

  # P4 -> P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 13
  - [[-1, 4], 1, Concat, [1]]                   # 14, cat with backbone P3 (index 4)
  - [-1, 2, C3_Res2Block,[256, True]]           # 15, Res2 neck for P3 (was A2C2f)

  # P3 -> P4 (downsample path)
  - [-1, 1, Conv,        [256, 3, 2]]           # 16
  - [[-1, 12], 1, Concat,[1]]                   # 17, cat with P4 neck (index 12)
  - [-1, 2, C3RFEM,      [512, False]]          # 18, RFEM neck for P4 (was A2C2f)

  # P4 -> P5 (downsample path)
  - [-1, 1, Conv,        [512, 3, 2]]           # 19
  - [[-1, 9], 1, Concat, [1]]                   # 20, cat with P5 backbone (index 9)
  - [-1, 2, C3_Res2Block,[1024, True]]          # 21, final head block (was C3k2)

  # Detection heads
  - [[15, 18, 21], 1, Detect, [nc]]             # Detect(P3, P4, P5)
